namespace KirisameVanilla.Reference;

public static class Buff
{
    public const uint
        牵制 = 1195,
        龙眼 = 1863,
        樱花缭乱 = 2719,
        樱花怒放 = 118,
        幻象冲预备 = 1243,
        死者之岸预备 = 3844,
        渡星冲预备 = 3846,
        龙炎升预备 = 3845;

    // 获取 Buff 名称
    public static string GetBuffName(uint buffId)
    {
        return buffId switch
        {
            牵制 => "牵制",
            龙眼 => "龙眼",
            樱花缭乱 => "樱花缭乱",
            樱花怒放 => "樱花怒放",
            幻象冲预备 => "幻象冲预备",
            死者之岸预备 => "死者之岸预备",
            渡星冲预备 => "渡星冲预备",
            龙炎升预备 => "龙炎升预备",
            _ => "未知 Buff"
        };
    }
}

public static class Skill
{
    public const uint
        猛枪 = 85,
        战斗连祷 = 3557,
        跳跃 = 92,
        龙剑 = 83,
        龙炎冲 = 96,
        武神枪 = 3555,
        幻象冲 = 7399,
        死者之岸 = 7400,
        天龙点睛 = 25773,
        牵制 = 7549,
        精准刺 = 75,
        真北 = 7546,
        直刺 = 84,
        苍穹刺 = 25771,
        开膛枪 = 87,
        螺旋击 = 36955,
        龙翼滑翔 = 36951,
        樱花怒放 = 88,
        樱花缭乱 = 25772,
        贯通刺 = 78,
        骤穿刺 = 36954,
        死天枪 = 86,
        音速刺 = 7397,
        山境酷刑 = 16477,
        龙爪龙牙 = 3554,
        龙尾大回旋 = 3556,
        云蒸龙变 = 36952,
        龙眼苍穹 = 25770,
        龙眼雷电 = 16479,
        坠星冲 = 16480,
        渡星冲 = 36956,
        龙炎升 = 36953,
        前冲刺 = 36954;

    // 获取技能名称
    public static string GetSkillName(uint skillId)
    {
        return skillId switch
        {
            猛枪 => "猛枪",
            战斗连祷 => "战斗连祷",
            跳跃 => "高跳",
            龙剑 => "龙剑",
            龙炎冲 => "龙炎冲",
            武神枪 => "武神枪",
            幻象冲 => "幻象冲",
            死者之岸 => "死者之岸",
            天龙点睛 => "天龙点睛",
            龙尾大回旋 => "龙尾大回旋",
            龙爪龙牙 => "龙爪龙牙",
            云蒸龙变 => "云蒸龙变",
            渡星冲 => "渡星冲",
            龙炎升 => "龙炎升",
            坠星冲 => "坠星冲",
            _ => "未知技能"
        };
    }
}